Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.GridCellSize
The cell size for the uniform cubical grid used when analyzing the building envelope.
Remarks:
This is the base size of the "cubes" used to divide the building shell
bounding box into a uniform cubical 3D grid. If this overrideGridCellSize option is set,
this exact value will be used for the grid cell size. The cell size should be specified in
the length unit for the Revit project.
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.OptimizeGridCellSize
Whether or not to use the exact value for the cell size or let the analyzer optimize the cell size based on the specified grid size
Remarks:
If this option is true, the analyzer will decide the optimal cell size for the uniform cubical grid used
when computing the building envelope. The optimal cell size is based on the specified cell size,
but can be higher. If this option is false, the exact specified grid cell size will be used.
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.AnalyzeEnclosedSpaceVolumes
Whether or not to analyze interior connected regions inside the building forming enclosed space volumes.
Remarks:
If true, the analyzer will also look for bounding building elements and
connected analytical grid cells for enclosed space volumes inside the building.
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.#ctor
Constructs a new instance of BuildingEnvelopeAnalyzerOptions, using default values.
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions
Specific options for the method analyzing the building elements for the building envelope.
Remarks:
The analyze method uses a combination of ray-casting and flood-fill
algorithms in order to find the building elements that are
exposed to the outside of the building.
The analyze method can also look for the bounding building elements for
enclosed space volumes inside the building.
Since:
2015